# LWByClass

## Description
Sets the default document line weight to the line weight of the active class.

```pascal
PROCEDURE LWByClass;
```

```python
def vs.LWByClass():
    return None
```

## Remarks
Sets the global attributes to use the line weight of the default class.
[sd 8/19/98]

## Examples
```pascal
LWByClass;
```
```python
vs.MarkerByClass()
vs.FPatByClass()
vs.LSByClass()
vs.LWByClass()
```

## Version
Availability: from VectorWorks8.0

## Category
* Classes